tap "jakehilborn/jakehilborn"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Configurable static site generator
brew "hugo"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Platform built on V8 to build network applications
brew "node"
# CLI for Mermaid library
brew "mermaid-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Port of pdftk in java
brew "pdftk-java"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Cross-shell prompt for astronauts
brew "starship"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Powerful free data recovery utility
brew "testdisk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Domain Availability Research Tool
brew "tldx"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-cascadia-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-maple-mono-normal"
cask "font-maple-mono-normal-cn"
cask "font-maple-mono-normal-nf"
cask "font-maple-mono-normal-nf-cn"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# App to manage software development and track bugs
cask "linear-linear"
# Open-source Markdown editor
cask "macdown"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Markdown editor with pandoc integration and paginated preview
cask "panwriter"
# PDF reader, editor and annotator
cask "pdf-expert"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# LaTeX editor
cask "texstudio"
# Web browser focusing on security
cask "tor-browser"
# Virtual machines UI using QEMU
cask "utm@beta"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-chmodbpf"
vscode "anthropic.claude-code"
vscode "beilunyang.cursor-rules"
vscode "catppuccin.catppuccin-vsc"
vscode "coderabbit.coderabbit-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-pt-br"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "subframe7536.custom-ui-style"
vscode "yjt.maple"
vscode "zhuangtongfa.material-theme"
