1password
1password-cli
anki
arc
basictex
burp-suite
chatgpt
claude
cursor
cyberduck
discord
docker-desktop
figma
font-cascadia-code
font-fira-code-nerd-font
font-hack-nerd-font
font-jetbrains-mono
font-jetbrains-mono-nerd-font
font-maple-mono
font-maple-mono-cn
font-maple-mono-nf
font-maple-mono-nf-cn
font-maple-mono-normal
font-maple-mono-normal-cn
font-maple-mono-normal-nf
font-maple-mono-normal-nf-cn
font-meslo-lg-nerd-font
font-source-code-pro
ghostty
google-chrome
iina
iterm2
jordanbaird-ice
linear-linear
macdown
notion
notion-calendar
notunes
obs
obsidian
orbstack
panwriter
pdf-expert
pearcleaner
setapp
slack
stremio
sublime-text
texstudio
tor-browser
utm@beta
visual-studio-code
wireshark-chmodbpf
